[{"model": "auth.user", "fields": {"password": "pbkdf2_sha256$870000$J2nqc1TJIQxQjWPYHIjGiY$n3KXN4XNHzABkSzAeB927HUDMPWZ7vxnwxoyP4lM6N0=", "last_login": "2025-06-20T17:36:49.734Z", "is_superuser": true, "username": "alcira", "first_name": "", "last_name": "", "email": "admin@example.com", "is_staff": true, "is_active": true, "date_joined": "2025-06-11T21:48:58.848Z", "groups": [], "user_permissions": []}}, {"model": "sessions.session", "pk": "ep551b3xprnv8aramf6nr8sgmvpudrt0", "fields": {"session_data": ".eJxVjDkOwjAUBe_iGln5Jt4o6TmD9RcHB5AjxUmFuDuylALaNzPvrRLuW0l7y2uaRV0UqNPvRsjPXDuQB9b7onmp2zqT7oo-aNO3RfLrerh_BwVb6bUd4siILEAhn72borPEIH5ALxKQYyQ2BqKAtZEp-EAgbkT2ZOykPl8CODia:1uSffV:tJEPzo31cR3G8XmPnNuxFROmNXZVap8nz3MX0cjL4HM", "expire_date": "2025-07-04T17:36:49.750Z"}}, {"model": "sessions.session", "pk": "fmm5zcrz6jd4es7t6uxbj6lem0eszk3t", "fields": {"session_data": ".eJxVjDkOwjAUBe_iGln5Jt4o6TmD9RcHB5AjxUmFuDuylALaNzPvrRLuW0l7y2uaRV0UqNPvRsjPXDuQB9b7onmp2zqT7oo-aNO3RfLrerh_BwVb6bUd4siILEAhn72borPEIH5ALxKQYyQ2BqKAtZEp-EAgbkT2ZOykPl8CODia:1uSQRh:NssMGBJUKHNyxjZ5i5-GgjW4cOvXLlnPwcHDAQtmzlU", "expire_date": "2025-07-04T01:21:33.144Z"}}, {"model": "sessions.session", "pk": "nykuki723mqegzh4zcu8tp0on13xqieh", "fields": {"session_data": ".eJxVjDkOwjAUBe_iGln5Jt4o6TmD9RcHB5AjxUmFuDuylALaNzPvrRLuW0l7y2uaRV0UqNPvRsjPXDuQB9b7onmp2zqT7oo-aNO3RfLrerh_BwVb6bUd4siILEAhn72borPEIH5ALxKQYyQ2BqKAtZEp-EAgbkT2ZOykPl8CODia:1uPTJz:eU3r5D47tyZ86_265P1P9MASE8I9NW_T9PhuxfnsDJQ", "expire_date": "2025-06-25T21:49:23.969Z"}}, {"model": "datos.marcometodo", "pk": 1, "fields": {"Marco_tipo": "ÁGIL", "Marco_nom": "SCRUM", "Marco_desc": "Las metodologías ágiles surgen en los años 90 como una respuesta a la necesidad de cambiar el <span><a href=\"#\"><b>Enfoque Tradicional de la Gestión de Proyectos</b></a></span>, conocida por ser altamente prescriptiva, poco flexible y con exceso de documentación; dificultando así la capacidad de adaptación requerida en contextos de alta incertidumbre. Esta necesidad de cambio se vio reflejada en la creación del <span><a href=\"#\"><b>Manifiesto Ágil</b></a></span> en 2001, que estableció los principios fundamentales de las metodologías ágiles, priorizando la colaboración, la adaptabilidad y la entrega continua de valor al cliente, a través del feedback constante con éste.\r\n\r\nAlgunas de las metodologías ágiles más conocidas son Scrum, Kanban, Extreme Programming (XP), Lean Software Development y Crystal, cada una de ellas tiene sus propias características y enfoques, pero todas comparten los principios del Manifiesto Ágil. \r\n\r\nEn esta sección nos enfocamos en Scrum, que es una de las más populares y ampliamente utilizadas en la industria del software."}}, {"model": "datos.marcometodo", "pk": 2, "fields": {"Marco_tipo": "PREDICTIVO", "Marco_nom": "CASCADA", "Marco_desc": ""}}, {"model": "datos.marcoobs", "pk": 1, "fields": {"Marc_Obs_orden": 1, "Marc_Obs_nom": "Control de Procesos Empírico:", "Marc_Obs_desc": "Hemos dicho que esperamos lo inesperado. En este tipo de enfoque, el progreso del trabajo está ligado a la inspección y adaptación en lugar de la planificación detallada de forma anticipada.\r\n\r\nAl construir un producto mediante el control de procesos empírico se busca trabajar con base en hechos, hipótesis y aprendizajes. Las características principales de esta forma de trabajar son:\r\n- Descubres a medida que construyes\r\n- Aceptas el cambio\r\n- Inspeccionas y adaptas frecuentemente", "Marco_ID": 1}}, {"model": "datos.marcoobs", "pk": 2, "fields": {"Marc_Obs_orden": 2, "Marc_Obs_nom": "¿Qué sí es Scrum?:", "Marc_Obs_desc": "Scrum es un marco de trabajo liviano que proporciona una estructura mínima para poder construir una solución de forma evolutiva.\r\nScrum es un diseño deliberadamente incompleto y minimalista. Cualquier persona, equipo u organización que desee crear productos de calidad con Scrum deberá complementarlo con técnicas y prácticas específicas de su industria. Scrum te dice qué hacer y no te dice cómo hacerlo.\r\n\r\nLa generación de valor a través de Scrum implica la creación de un producto de forma tal que lo puedas ver funcionando muy frecuentemente a medida que crece y evoluciona. De esta manera lo podrás inspeccionar y adaptar todo lo que consideres necesario.\r\n\r\nEste enfoque sólo tiene sentido si estás frente a problemas complejos e inciertos, donde no solo debes construir un producto, sino también descubrir en paralelo qué producto construir.", "Marco_ID": 1}}, {"model": "datos.marcoobs", "pk": 3, "fields": {"Marc_Obs_orden": 5, "Marc_Obs_nom": "¿Qué no es Scrum?:", "Marc_Obs_desc": "Scrum no es un enfoque para gestionar proyectos ni equipos. En Scrum no hay gerentes que dirijan y controlen el trabajo que realizan las personas del equipo. Específicamente en este punto, Scrum se basa en la capacidad de autogestión del equipo, quien tiene completa autonomía para elegir en qué\r\ntrabajar, cómo hacerlo y quiénes lo hacen dentro del equipo.\r\n\r\nScrum no es una metodología con procesos, subprocesos, inputs y outputs. Scrum no es un método para hacer seguimiento detallado, día a día, de las tareas individuales de los miembros del equipo Scrum. Scrum no sirve si lo que quieres es seguir haciendo lo mismo, pero más rápido.", "Marco_ID": 1}}, {"model": "datos.marcoobs", "pk": 4, "fields": {"Marc_Obs_orden": 6, "Marc_Obs_nom": "Aprendes haciendo y observando:", "Marc_Obs_desc": "El conocimiento es información, el aprendizaje es acción.\r\nAprender es poder hacer algo que antes no podías hacer. Incorporar información no es aprender, es conocer más. Incorporar acción sí es aprender, es hacer más de forma efectiva.\r\n\r\nDebes aprender cuál es el producto correcto para generar en las personas los comportamientos que quieres promover. Ese aprendizaje no lo vas a lograr en el campo intelectual, lo vas a lograr en el campo práctico, haciendo, observando, analizando la puesta en práctica, descubriendo el uso que las personas le dan a los productos que construyes.\r\n\r\nAprendes observando y adaptando. Observando y adaptando. Observando y adaptando.", "Marco_ID": 1}}, {"model": "datos.marcoobs", "pk": 5, "fields": {"Marc_Obs_orden": 4, "Marc_Obs_nom": "¿Cuál es el Planteamiento de SCRUM?:", "Marc_Obs_desc": "En lugar de haber un planteamiento global de toda la solución, solamente propone un planteamiento inicial de cómo se podría ejecutar un determinado proyecto. En base a todo eso, se tendrá:\r\n\r\n- Una serie de requerimientos priorizados el cual se llama Product Backlog\r\n\r\n- En cada iteración del proyecto llamada SPRINT, se seleccionarán una serie de requerimientos priorizados del Product Backlog, para ejecutar durante ese SPRINT. Estos SPRINTS no tienen una duración muy alargada, si no que van de dos a cuatro semanas dependiendo del proyecto; permitiendo así mayor adaptación al cambio\r\n\r\n- Al final de cada SPRINT, se tiene un INCREMENTO, que es una nueva funcionalidad sobre el producto que se ha venido desarrollando, teniendo así multiples mini entregas y puestas en marcha, que generan un nuevo incremento alineado a las necesidades del cliente", "Marco_ID": 1}}, {"model": "datos.marcoobs", "pk": 6, "fields": {"Marc_Obs_orden": 3, "Marc_Obs_nom": "¿Cómo está compuesto SCRUM?:", "Marc_Obs_desc": "El Marco Metodológico de SCRUM, está compuesto por ROLES, EVENTOS y ARTEFACTOS, los cuales estaremos ampliando en las diferentes secciones de la vista principal de SCRUM\r\n\r\n- \"ROLES\": están compuestps por: \r\na) EQUIPO DE PROYECTO\r\nb) PRODUCT OWNER\r\nc) DESARROLLADORES \r\nd) SCRUM MASTER\r\n\r\n- \"EVENTOS\": Corresponden a todas las reuniones que se tendrán a lo largo del proyecto que contribuyen con la transparencia, con la obtención de Feedback del cliente, haciendo hincapié en cómo ve el éste el valor que se le va entregando en cada incremento. Estos son: \r\na) SPRINT PLANNING\r\nb) SPRINT (Contenedor del enfoque Scrum)\r\nc) DAILY SCRUM\r\nd) SPRINT REVIEW\r\ne) SPRINT RESTROSPECTIVE\r\n\r\n- \"ARTEFACTOS\": Contribuyen a dar transparencia a todo lo que se está haciendo y están conformados por:\r\na) PRODUCT BACKLOG\r\nb) SPRINT BACKLOG\r\nc) INCREMENTO", "Marco_ID": 1}}, {"model": "datos.rol", "pk": 1, "fields": {"Rol_nom": "EQUIPO SCRUM", "Rol_desc": "El Equipo Scrum funciona como centro de creación de Incrementos con el propósito de lograr el objetivo del producto. Ser la \"unidad fundamental de Scrum\" no es un detalle que debas pasar por alto. Todo lo contrario. Scrum sucede dentro del equipo y por ello desde el lugar que ocupes tienes que cuidarlo como la piedra fundamental a partir de la cual vendrá el resto.\r\nDentro de este equipo puedes ocupar uno de tres roles:\r\n   a) Desarrollador\r\n   b) Product Owner\r\n   c) Scrum Master\r\n\r\nTanto si ocupas el rol de Scrum Master como si ocupas el rol de Product Owner podrías ocupar en paralelo el rol de Desarrollador, aunque no es requerido. Pero cuidado, no debes ocupar el rol de Product Owner y el de Scrum Master juntos dado que ambos roles funcionan por oposición de intereses.\r\nScrum no reconoce ningún tipo de jerarquía dentro de tu equipo, subequipos ni roles que no sean los mencionados previamente. \r\n\r\nDado que Scrum está diseñado para responder a bajo costo a los cambios inherentes a los ambientes complejos, tanto la estructura como el tamaño de tu equipo deben estar orientados a este fin.\r\n\r\nUn Equipo Scrum tiene típicamente no más de 10 personas. Una mayor cantidad de personas ha demostrado no ser lo suficientemente eficiente a la hora de cambiar de dirección y tomar decisiones ágilmente. No debe ser muy pequeño tampoco, sino del tamaño necesario para que el Incremento producido en cada Sprint sea de un valor considerable.\r\n\r\nLos equipos muy grandes se dividen en Equipos Scrum de no más de 10 personas, todos trabajando en un mismo producto, compartiendo no solo un único Product Owner, sino enfocados en un único objetivo de producto y Product Backlog. En el caso que desees profundizar en el uso de Scrum a\r\ngran escala te recomiendo un marco derivado de Scrum que se llama LeSS (Large Scale Scrum).\r\n\r\nEl Equipo Scrum es un equipo multi-funcional. Un factor importante para considerar relacionado con el tamaño es que se espera que dentro del Equipo Scrum se cuente con todas las habilidades necesarias para poder entregar Incrementos de valor al final de cada Sprint. Esto implica que no necesites de la intervención de personas externas al equipo. Esta característica la llamamos multifuncionalidad. \r\n\r\nEl Equipo Scrum es un equipo autogestionado. Nadie externo al equipo interviene decidiendo tampoco qué trabajo realizan, cuándo lo realizan ni cómo lo realizan. Las decisiones sobre estos tres aspectos son potestad exclusiva del Equipo Scrum. El equipo Scrum decide el qué, el cuándo y el cómo. Esta característica la llamamos autogestión. \r\n\r\nApelando a su capacidad multi-funcional y de autogestión, el Equipo Scrum es responsable de hacer todo lo que sea necesario para entregar un Incremento al final de cada Sprint. Esto no solo incluye la construcción del Incremento, sino que también abarca la colaboración con los stakeholders, la investigación, la experimentación, la negociación, la capacitación, el aprendizaje, etc.", "Marco_ID": 1}}, {"model": "datos.rol", "pk": 2, "fields": {"Rol_nom": "DESARROLLADORES", "Rol_desc": "La designación de Desarrollador abarca cualquiera de los roles necesarios para construir el producto. Por ejemplo, si estamos construyendo sillas, el carpintero, el tapicero, el pintor, el diseñador y el probador de sillas son Desarrolladores. Si estuviésemos construyendo software entonces el tester sería un Desarrollador, el programador sería un Desarrollador, el analista de negocio, el diseñador de interfaz de usuario, el de back-end, el administrador de bases de datos, etc. serían todos Desarrolladores.\r\n\r\nSi ocupas este rol, al margen de las habilidades técnicas que debas tener, las cuales varían según la industria en la cual te desempeñas, hay ciertas responsabilidades que son inalienables a ti y a los demás desarrolladores, las cuales nombraremos en esta sección pero detallaremos en las responsabilidades\r\n\r\na) Crear el Plan del Sprint. \r\nb) Entregar solo aquello que esté “terminado”. \r\nc) Adaptar el plan frecuentemente. \r\nd) Se consideran mutuamente responsables.", "Marco_ID": 1}}, {"model": "datos.rol", "pk": 3, "fields": {"Rol_nom": "PRODUCT OWNER", "Rol_desc": "Si la elección es ocupar el rol de Product Owner, no sevdebe perder de vista que sigue siendo parte del Equipo Scrum. En particular, el responsable del producto desde el punto de vista de negocio. Se debe velar por que los Incrementos que se entregan como parte del Equipo Scrum sean del mayor valor posible en cada Sprint.\r\n\r\nAl ocupar este rol se debe asumir que será el único responsable de tomar decisiones acerca del producto. El producto puede ser un producto digital, físico, un servicio o, inclusive, algo más abstracto como una experiencia.\r\n\r\nAunque puede recibir ayuda de otros, el Product Ownership no es un trabajo que realiza un comité, lo realizas una sola persona. También es importante considerar que, si bien podría tomar acciones en el rol de desarrollador, el rol de Product Owner es completamente incompatible con desempeñar al mismo tiempo el rol de Scrum Master. \r\n\r\nA continuación de listan sus funciones:\r\na) Establecer los objetivos del producto.\r\nb) Garantizas el entendimiento del Product Backlog. \r\nc) Determina el orden en el que se hace el trabajo \r\nd) Visibilizar el Product Backlog.", "Marco_ID": 1}}, {"model": "datos.rol", "pk": 4, "fields": {"Rol_nom": "SCRUM MASTER", "Rol_desc": "El Scrum Master es responsable de establecer Scrum como se define en la Guía de Scrum. Logra esto ayudando a todos a comprender la teoría y la práctica de Scrum, tanto dentro del Equipo Scrum como de la organización.\r\n                                                          - Guía de Scrum\r\n\r\nEl Scrum Master, debe lograr comprender Scrum en profundidad.\r\n- Su foco está puesto en el proceso de trabajo y en la mejora continua. \r\n- Su objetivo es que el Equipo Scrum se desarrolle y logre ser un equipo: a) Competente: en el uso de Scrum. No solo en el conocimiento, sino en la puesta en práctica, b) Autogestionado: poder decidir quién trabaja en qué, cómo lo hace y cuándo lo hace y c) Multifuncional: no depender de terceros para construir un Incremento en cada Sprint.\r\n\r\nPara complementar este rol, es recomendable desarrollar y dominar cuatro disciplinas claves: el training, la consultoría, la facilitación y el coaching.\r\n\r\n- Las habilidades de training te van a servir para poder transmitir los conocimientos necesarios para comprender Scrum.\r\n- Las habilidades de consultoría te serán útiles para aconsejar al Equipo Scrum y a los stakeholder cómo hacer uso de Scrum de una forma eficiente y evitando anti-patrones.\r\n- La facilitación será una habilidad clave a la hora de facilitar los diferentes eventos de Scrum y hacer que sean encuentros significativos para todos los involucrados con resultados de valor.\r\n- El coaching es una competencia esencial para acompañar al Equipo Scrum a superarse Sprint tras Sprint, derribar creencias auto limitantes y expandir su abanico de posibilidades con vistas a la entrega de valor. Mejorar sus prácticas particulares dentro del framework de Scrum.\r\n\r\nFunciones:\r\na) Lideras Servicialmente\r\nb) Dar ervicio a: Equipo Scrum, Product Owner y a la organización", "Marco_ID": 1}}, {"model": "datos.rol", "pk": 5, "fields": {"Rol_nom": "GERENTE DE PROYECTOS", "Rol_desc": "", "Marco_ID": 2}}, {"model": "datos.domeco", "pk": 1, "fields": {"DomEco_nom": "ECO", "DomEco_desc": "xxxxxxxxx"}}, {"model": "datos.domeco", "pk": 2, "fields": {"DomEco_nom": "Dominio I", "DomEco_desc": "Personas: 42 % | \"Interesados\" | \"Equipo\""}}, {"model": "datos.domeco", "pk": 3, "fields": {"DomEco_nom": "Dominio II", "DomEco_desc": "Proceso: 50 % ! Planificación | Trabajo del Proyecto | Estrategia"}}, {"model": "datos.domeco", "pk": 4, "fields": {"DomEco_nom": "Dominio III", "DomEco_desc": "Entorno de negocio: 8 % | Enfoque de Desarrollo y Ciclo de Vida | Entrega | Incertidumbre"}}, {"model": "datos.domdes", "pk": 1, "fields": {"DomDes_nom": "DESCRIPCIÓN GENERAL", "DomDes_obj": "Grupo de actividades relacionadas, fundamentales para la entrega de los resultados del proyecto", "DomDes_ben": "Estas áreas de Foco son conocidas en la guía del <b>PMBOK 7</b>, como <b>Dominios de Desempeño del proyecto</b> y sus principales características son que: \r\n» No existe una secuencia prescriptiva para ejecutar estas actividades.\r\n» Se pueden utilizar con diferentes enfoques de entrega (predictivo, ágil, híbrido).\r\n» No son procesos.\r\n» Son interactivos, interdependientes e interrelacionados.\r\n\r\nJuntos, los dominios de desempeño forman un conjunto unificado. De esta manera, los dominios de desempeño funcionan como un sistema integrado, en el que cada uno es interdependiente de los demás para permitir la entrega satisfactoria del proyecto y sus resultados previstos.\r\n\r\nLos dominios de desempeño se ejecutan simultáneamente a lo largo del proyecto, independientemente de la forma en que se entregue el valor (frecuentemente, periódicamente o al final del proyecto). Por ejemplo, los líderes de proyecto le dedican tiempo a los interesados, al equipo de proyecto, al ciclo de vida del proyecto, al trabajo del proyecto y así sucesivamente, desde el comienzo del proyecto hasta su clausura. Estas áreas de interés no son abordadas como esfuerzos aislados porque se superponen e interconectan. \r\n\r\nLas maneras en que se relacionan los dominios de desempeño son diferentes para cada proyecto, pero están presentes en cada uno. Las actividades específicas que se llevan a cabo en cada uno de los dominios de desempeño están determinadas por el contexto de la organización, el proyecto, los entregables, el equipo de proyecto, los interesados y otros factores. \r\n\r\nLos dominios de desempeño son presentados en la siguiente lista, sin que haya una ponderación o un orden específico:", "DomEco_ID": 1}}, {"model": "datos.domdes", "pk": 2, "fields": {"DomDes_nom": "INTERESADOS", "DomDes_obj": "Combina Actividades relacionadas con los interesados, para garantizar relaciones productivas", "DomDes_ben": "Las siguientes definiciones son relevantes para el Dominio de Desempeño de los Interesados:\r\n\r\n- <b>Interesado.</b> Individuo, grupo u organización que puede afectar, verse afectado o percibirse a sí mismo como afectado por una decisión, actividad o resultado de un proyecto, programa o portafolio.\r\n\r\n- <b>Análisis de Interesados.</b> Método que consiste en recopilar y analizar de manera sistemática información cuantitativa y cualitativa, a fin de determinar los intereses de quienes deberían tenerse en cuenta a lo largo del proyecto. Este método lo revisaremos a profundidad en el apartado <b>\"Más Detalles\"</b>, que estará disponible en una próxima entrega.\r\n\r\nLos proyectos son realizados por las personas y para las personas. Este ámbito de desempeño implica trabajar con los interesados para mantener la alineación y colaborar con ellas para fomentar las relaciones positivas y la satisfacción\r\n\r\nLa ejecución efectiva de este dominio de desempeño y del análisis de interesados, tiene los siguientes resultados deseados:\r\n- Una relación de trabajo productiva con los interesados a lo largo del proyecto\r\n- Acuerdos de los interesados con los objetivos del proyecto\r\n- Los interesados que son beneficiarios del proyecto, brindan apoyo y están satidfechos; los interesados que pueden oponerse al proyecto o a sus estregables, no afectan negativamente los resultados del proyecto", "DomEco_ID": 2}}, {"model": "datos.domdes", "pk": 3, "fields": {"DomDes_nom": "EQUIPO", "DomDes_obj": "Se ocupa de las actividades y Funciones asociadas con el equipo responsable de los entregables", "DomDes_ben": "La ejecución efectiva de este dominio de desempeño tiene los siguientes resultados deseados:\r\n\r\n- Propiedad Compartida\r\n- Equipo de Alto Rendimiento\r\n- Todos los miembros del equipo demuestran liderazgo aplicable y otras habilidades interpersonales\r\n\r\nEste dominio de desempeño implica establecer la cultura y el entorno que permita a un conjunto de diversos individuos evolucionar hasta convertirse en un equipo de proyecto de alto rendimiento. Esto incluye el reconocimiento de las actividades necesarias para fomentar el desarrollo del equipo de proyecto y alentar los comportamientos de liderazgo de todos los miembros del mismo.\r\n\r\nLas siguientes definiciones son pertinentes para el Dominio de Desempeño del Equipo:\r\n- Director del Proyecto. Persona nombrada por la organización ejecutante para liderar al equipo de proyecto que es responsable de alcanzar los objetivos del mismo.\r\n\r\n- Equipo de Dirección de Proyecto. Miembros del equipo de proyecto que participan directamente en las actividades de dirección del proyecto.\r\n\r\n- Equipo de Proyecto. Conjunto de individuos que realizan el trabajo del proyecto co n el fin de alcanzar sus objetivos.", "DomEco_ID": 2}}, {"model": "datos.domdes", "pk": 4, "fields": {"DomDes_nom": "ENFOQUE DE DESARROLLO Y DEL CICLO DE VIDA", "DomDes_obj": "Aborda actividades y funciones asociadas con el enfoque de desarrollo, cadencia y fases", "DomDes_ben": "Este dominio de desempeño implica establecer el enfoque de desarrollo, la cadencia de entrega\r\ny el ciclo de vida del proyecto necesarios para optimizar los resultados del mismo.\r\n\r\nLa ejecución efectiva de este dominio de desempeño, tiene los siguientes resultados deseados:\r\n- Enfoques de desarrollo consistentes con los entregables del proyecto\r\n\r\n- Ciclo de vida del Proyecto que consiste en fases que conectan la entrega del valor del negocio y para los interesados, desde el comienzo hasta el final del proyecto\r\n\r\n- Un ciclo de vida del proyecto que consta de fases que facilitan la cadencia de entrega y el enfoque de desarrollo necesarios para elaborar los entregables del proyecto\r\n\r\nLas siguientes definiciones son pertinentes para el Dominio de Desempeño del Enfoque de Desarrollo y Ciclo de Vida:\r\n- Entregable. Cualquier producto, resultado o capacidad única y verificable para ejecutar un servicio que se debe producir para completar un proceso, una fase o un proyecto.\r\n\r\n- Enfoque de Desarrollo. Método utilizado para crear y desarrollar el producto, servicio o resultado durante el ciclo de vida del proyecto, tal como un método predictivo, iterativo, incremental, adaptativo o híbrido.\r\n\r\n- Cadencia. Ritmo de las actividades realizadas a lo largo del proyecto.\r\n\r\n- Fase del Proyecto. Conjunto de actividades del proyecto relacionadas lógicamente que culmina con la finalización de uno o más entregables.\r\n\r\n- Ciclo de Vida del Proyecto. Serie de fases que atraviesa un proyecto desde su inicio hasta\r\nsu conclusión.", "DomEco_ID": 4}}, {"model": "datos.domdes", "pk": 5, "fields": {"DomDes_nom": "PLANIFICACIÓN", "DomDes_obj": "Actividades asociadas con la organización y coordinación iniciales", "DomDes_ben": "El propósito de la planificación es desarrollar proactivamente un enfoque para crear los entregables del proyecto. Los entregables del proyecto impulsan los resultados para los que se acometió el proyecto. La planificación de alto nivel puede comenzar antes de la autorización del proyecto. El equipo de proyecto elabora progresivamente documentos iniciales del proyecto, como una declaración de visión, un acta de constitución del proyecto, un caso de negocio o documentos similares para identificar o definir una ruta coordinada para lograr los resultados deseados.\r\n\r\nLa ejecución efectiva de este dominio de desempeño, tiene los siguientes resultados esperados:\r\n- El proyecto avanza de manera organizada, coordinada y deliberada\r\n\r\n- Existe un enfoque holístico para entregar los resultados del proyecto\r\n\r\n- Se elabora información evolutiva para obtener los entregables y los resultados para los cuales se emprendió el proyecto\r\n\r\n- El tiempo empleado para la planificación es adecuado para la situación\r\n\r\n- La información de planificación es suficiente para gestionar las expectativas de los interesados\r\n\r\nLas siguientes definiciones son pertinentes para el Dominio de Desempeño de la Planificación:\r\n\r\n- Estimación. Evaluación cuantitativa del valor o resultado probable de una variable, tal como\r\ncostos del proyecto, recursos, esfuerzo o duraciones.\r\n\r\n- Exactitud. En el sistema de gestión de calidad, la exactitud es una evaluación de la corrección.\r\n\r\n- Precisión. En el sistema de gestión de calidad, la precisión es una evaluación de la exactitud.\r\n\r\n- Intensificación. Método utilizado para acortar la duración del cronograma con el menor incremento de costo mediante la adición de recursos.\r\n\r\n- Ejecución Rápida. Método de compresión del cronograma en el que actividades o fases que normalmente se realizan en secuencia se llevan a cabo en paralelo, al menos durante una parte de su duración.\r\n\r\n- Presupuesto. Estimación aprobada para el proyecto o cualquier componente de la estructura de desglose del trabajo (EDT) o cualquier actividad del cronograma.", "DomEco_ID": 3}}, {"model": "datos.domdescoment", "pk": 1, "fields": {"DomDesComent_orden": 1, "DomDesComent_tit": "INTERESADOS DEL PROYECTO", "DomDesComent_desc": "Los interesados incluyen individuos, grupos y organizaciones (véase Gráfico Ejemplo de Interesados). Un proyecto puede tener un pequeño grupo de interesados o, potencialmente, millones de interesados. Puede haber diferentes interesados en diferentes fases del proyecto, y la influencia, el poder o los intereses de los interesados pueden cambiar a medida que se desarrolla el proyecto.\r\n\r\nSi bien es cierto que contar con las habilidades técnicas pertinentes para la dirección de proyectos es un aspecto importante de los proyectos exitosos, contar con las habilidades interpersonales y de liderazgo para trabajar eficazmente con los interesados es tan o más importante", "DomDes_Url": "https://drive.google.com/file/d/1jUc3Q1JNlpQ5nsa-kofWZ9RLfeboK3hl/view?usp=drive_link", "DomDes_ID": 2}}, {"model": "datos.domdescoment", "pk": 2, "fields": {"DomDesComent_orden": 2, "DomDesComent_tit": "INVOLUCRAMIENTO DE LOS INTERESADOS", "DomDesComent_desc": "El involucramiento de los interesados comprende la aplicación de estrategias y medidas para promover la participación productiva de los interesados. Las actividades de involucramiento de los interesados comienzan antes o cuando se inicia el proyecto y continúan a lo largo del mismo\r\n\r\nDefinir y compartir una clara visión al comienzo del proyecto puede permitir buenas relaciones y alineación en todo el proyecto. El establecimiento de una visión clara con la que los principales interesados estén de acuerdo puede implicar algunas negociaciones difíciles, especialmente con los interesados que no estén necesariamente a favor del proyecto o de sus resultados previstos. Como se muestra en el Gráfico 2-3, existen varios pasos para lograr la participación efectiva de los interesados.", "DomDes_Url": null, "DomDes_ID": 2}}, {"model": "datos.mma", "pk": 2, "fields": {"MMA_tipo": "MÉTODO", "MMA_clase": "Otros Métodos", "MMA_nom": "SPRINT", "MMA_desc": "El Sprint es un contenedor para todos los demás eventos… Los Sprints son el corazón de Scrum, donde las ideas se convierten en valor.\r\n- Guía de Scrum\r\n\r\nScrum, al ser un proceso de desarrollo incremental y evolutivo, utiliza periodos consecutivos de tiempo corto para construir un producto, Incremento tras Incremento, para inspeccionar y adaptar frecuentemente tanto el producto como el proceso utilizado. A estos periodos de tiempo acotado, en Scrum, se los identifica como Sprints.\r\n\r\nTodos los eventos de Scrum, Sprint Planning, Daily Scrums, Sprint Review y Sprint Retrospective, y todo el trabajo que sea necesario hacer para transformar los PBIs en un Incremento sucede dentro de un Sprint.\r\n\r\nEn general, Scrum recomienda una duración de Sprint de un mes o menos, siendo una o dos semanas lo más habitual que encontrarás en la industria.\r\n\r\nUna de las decisiones que debes tomar al comenzar el desarrollo de un producto o al adoptar Scrum es la duración de los Sprints. Luego, mantendrás esa duración constante a lo largo del tiempo, lo que implicará que la duración de un Sprint no cambia una vez que sea establecida. Como excepción podrías considerar aquellas situaciones donde el equipo mismo decida probar con Sprints más largos o cortos. Esta decisión se basa principalmente en la volatilidad del contexto: mientras más volátil sea (negocio cambiante, necesidades desconocidas, tecnología que evoluciona, etc.) más corta será la duración del Sprint. Lo importante es recordar que se logra mayor ritmo y previsibilidad teniendo Sprints de duración constante", "DominiosDes": [4, 5], "Marcos": [1]}}, {"model": "datos.mma", "pk": 3, "fields": {"MMA_tipo": "MÉTODO", "MMA_clase": "Reuniones y Eventos", "MMA_nom": "SPRINT PLANNING", "MMA_desc": "El Sprint Planning inicia el Sprint al establecer el trabajo que se realizará para el Sprint.\r\n- Guía de Scrum\r\n\r\nEl Sprint Planning es el primer evento que se realiza dentro del Sprint. La dinámica de este evento es de tipo taller donde todo el Equipo Scrum pone manos a la obra. La duración máxima de una Sprint Planning es de ocho horas para un Sprint de cuatro semanas, reduciéndose en longitud para Sprints más cortos.\r\n\r\nEn el Sprint Planning se deciden tres aspectos:\r\n\r\n- El Objetivo del Sprint, es decir, para qué hacer este Sprint\r\n\r\n- Los <span><a href=\"#\"><b>PBIs</b></a></span> que formarán parte en este Sprint, es decir, qué incremento construir\r\n\r\n- El plan del Sprint, o sea, cómo será construido el Incremento\r\n\r\nTodo esto en conjunto formará el Sprint Backlog.", "DominiosDes": [2, 5], "Marcos": [1]}}, {"model": "datos.mmaelement", "pk": 2, "fields": {"MMAElem_orden": 1, "MMAElem_nom": "Duración y objetivo fijos", "MMAElem_desc": "Durante un Sprint, el Equipo Scrum podría atrasarse o adelantarse con respecto a su trabajo. En estos casos, la variable de ajuste será el alcance del Sprint, nunca su duración. Esto significa, en el caso de adelantarnos deberemos incrementar el alcance del Sprint agregando nuevos PBIs y reducirlo en el caso de retrasarnos, pero nunca acortar o alargar el tiempo de Sprint. Esta decisión de aumentar o reducir el alcance del Sprint es una potestad del Equipo Scrum y, por lo tanto, tomada entre los Desarrolladores y el Product Owner.\r\n\r\nComo te comenté anteriormente, el Sprint Backlog contiene el plan del Sprint. A medida que se avanza, se descubre y se aprende durante el Sprint, ese plan podría alterarse sin alterar el Objetivo del Sprint. Los cambios en el plan son gestionados por los Desarrolladores.", "MMAElem_Url": null, "MMA_ID": 2}}, {"model": "datos.mmaelement", "pk": 3, "fields": {"MMAElem_orden": 2, "MMAElem_nom": "Calidad no negociable", "MMAElem_desc": "A partir de lo que acabo de contarte podrías deducir que, frente a imprevistos o impedimentos, la calidad nunca es negociable. El nivel de calidad de las entregas está determinado por lo que hemos llamado <b>Definición de Terminado</b>, la cual no se altera. Esto quiere decir que, si el Equipo Scrum se atrasa con respecto a lo que debe entregar, nunca va a probar menos o construir con menor calidad para poder entregar todo en el Sprint, sino que se abrirá un espacio de negociación a la interna del Equipo Scrum donde Desarrolladores y Product Owner decidirán cómo ajustan el alcance sin afectar el Objetivo del Sprint ni la Definición de Terminado.\r\n\r\nRecuerda, el compromiso en esta instancia es construir un Incremento que logre el Objetivo del Sprint respetando la Definición de Terminado. El Equipo Scrum nunca debe comprometerse a entregar un número determinado de PBIs.", "MMAElem_Url": null, "MMA_ID": 2}}, {"model": "datos.mmaelement", "pk": 4, "fields": {"MMAElem_orden": 3, "MMAElem_nom": "Progreso durante el Sprint", "MMAElem_desc": "El progreso durante el Sprint es seguido día a día por los Desarrolladores. Existe un evento diario del que te hablaré más adelante, Daily Scrum, donde se revisa si el estado actual del trabajo realizado nos conduce hacia el logro del Objetivo del Sprint. En caso de que eso no suceda, los Desarrolladores toman la decisión de adaptar el plan restante del Sprint para acercarse nuevamente al logro del objetivo.", "MMAElem_Url": null, "MMA_ID": 2}}, {"model": "datos.mmaelement", "pk": 5, "fields": {"MMAElem_orden": 4, "MMAElem_nom": "Cancelación de un Sprint", "MMAElem_desc": "Un Sprint puede cancelarse si el Objetivo del Sprint se vuelve obsoleto. Esto sucede cuando las condiciones del entorno cambian tan drásticamente que ya no tiene sentido que el Equipo Scrum siga trabajando en lo que está trabajando y necesite mover su atención a algo mucho más importante.\r\n\r\nComo te comentaba anteriormente, el hecho de descubrir que no se llega a completar el trabajo del Sprint no es una razón válida para su cancelación dado que, aun construyendo un Incremento más pequeño que el esperado se podría lograr el Objetivo del Sprint.\r\n\r\nLa cancelación de un Sprint en una decisión que solo el Product Owner está en condiciones de tomar.", "MMAElem_Url": null, "MMA_ID": 2}}, {"model": "datos.mmaelement", "pk": 6, "fields": {"MMAElem_orden": 1, "MMAElem_nom": "Definición del Objetivo de Sprint", "MMAElem_desc": "El Objetivo del Sprint describe la razón por la cual vale la pena realizar el trabajo del Sprint. El mismo surge de forma colaborativa y es creado por el Equipo Scrum a partir del input del Product Owner, quien expone al resto una propuesta de Incremento de valor y usabilidad del producto. Por ejemplo, “dar la posibilidad a los usuarios de ordenar online” o “validar si la integración del log-in con redes sociales disminuye la fricción y aumenta la conversión” o “presentar los Keynotes de la conferencia y abrir los registros de participantes”.", "MMAElem_Url": null, "MMA_ID": 3}}]